---
kind: other
id: Methods.T:Autodesk.Revit.UI.IDropHandler
source: html/9303afbd-d159-ba0a-0d2f-d53d0ecfab42.htm
---
# IDropHandler Methods

Implement this method to handle the drop event for your data.